; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared1 - mode
	image0 - mode
	spectrograph4 - mode
	thermograph5 - mode
	spectrograph2 - mode
	image3 - mode
	GroundStation5 - direction
	Star6 - direction
	Star2 - direction
	Star7 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star3 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph5)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star7)
	(supports instrument3 image0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star7)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument5 thermograph5)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
)
(:goal (and
	(have_image Phenomenon8 spectrograph2)
	(have_image Phenomenon8 thermograph5)
	(have_image Star9 image0)
	(have_image Star9 spectrograph2)
	(have_image Planet10 thermograph5)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon11 image3)
	(have_image Planet12 image3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
2. (calibrate satellite1 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 9
3. (turn_to satellite1 phenomenon8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 9
4. (take_image satellite1 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon11)
   goals met: 1 of 9
6. (turn_to satellite0 star2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star2)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon11 instrument2 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 2 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
9. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 2 of 9
10. (turn_to satellite0 phenomenon11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
11. (take_image satellite0 phenomenon11 instrument0 image3)
   added: (have_image phenomenon11 image3)
   goals met: 3 of 9
12. (turn_to satellite0 phenomenon8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 9
13. (take_image satellite0 phenomenon8 instrument0 thermograph5)
   added: (have_image phenomenon8 thermograph5)
   goals met: 4 of 9
14. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 4 of 9
15. (take_image satellite0 planet10 instrument0 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 5 of 9
16. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 5 of 9
17. (take_image satellite0 planet12 instrument0 image3)
   added: (have_image planet12 image3)
   goals met: 6 of 9
18. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 6 of 9
19. (take_image satellite1 planet10 instrument2 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 7 of 9
20. (turn_to satellite1 star9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star9)
   goals met: 7 of 9
21. (take_image satellite1 star9 instrument2 image0)
   added: (have_image star9 image0)
   goals met: 8 of 9
22. (take_image satellite1 star9 instrument2 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 9 of 9
